In [146]:
import pandas as pd
import re

In [147]:
df= pd.read_csv("Data\initial_data.csv")

In [148]:
df.head()

           Price Bedrooms Bathrooms     Area                  Location
0    EGP 500,000        3         1  120 SQM        Miami, Alexandria•
1  EGP 3,600,000        4         3  265 SQM      Laurent, Alexandria•
2  EGP 6,500,000        2         3  214 SQM  San Stefano, Alexandria•
3  EGP 3,060,000        3         3  204 SQM  San Stefano, Alexandria•
4  EGP 2,500,000        3         3  165 SQM      Laurent, Alexandria•

In [149]:
df.describe()

,Price,Bedrooms,Bathrooms,Area,Location
count,8955,8955,8955,8955,8955
unique,1063,10,11,313,53
top,"EGP 290,000Negotiable",3,1,120 SQM,"Nakheel, Alexandria•"
freq,106,4717,4600,678,1941

In [150]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8955 entries, 0 to 8954
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      8955 non-null   object
 1   Bedrooms   8955 non-null   object
 2   Bathrooms  8955 non-null   object
 3   Area       8955 non-null   object
 4   Location   8955 non-null   object
dtypes: object(5)
memory usage: 349.9+ KB

## Lets First Clean Remove strings from price, aream, bedrooms, and bathrooms

In [151]:
df['Price'] = df["Price"].str.replace(r"[\D]",'',regex=True)
df['Price'] = df['Price'].astype(int)

df['Area'] = df["Area"].str.replace(r"[\D]",'',regex=True)
df['Area'] = df['Area'].astype(int)

df['Bedrooms'] = df["Bedrooms"].str.replace(r"[\D]",'',regex=True)
df['Bedrooms'] = df['Bedrooms'].astype(int)

df['Bathrooms'] = df["Bathrooms"].str.replace(r"[\D]",'',regex=True)
df['Bathrooms'] = df['Bathrooms'].astype(int)

In [152]:
df.head()

     Price  Bedrooms  Bathrooms  Area                  Location
0   500000         3          1   120        Miami, Alexandria•
1  3600000         4          3   265      Laurent, Alexandria•
2  6500000         2          3   214  San Stefano, Alexandria•
3  3060000         3          3   204  San Stefano, Alexandria•
4  2500000         3          3   165      Laurent, Alexandria•

In [153]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8955 entries, 0 to 8954
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      8955 non-null   int32
 1   Bedrooms   8955 non-null   int32
 2   Bathrooms  8955 non-null   int32
 3   Area       8955 non-null   int32
 4   Location   8955 non-null   object
dtypes: int32(4), object(1)
memory usage: 210.0+ KB

## Remove "Alexandria" and only keep the location

In [163]:
df["Location"] = df["Location"].str.split(',').str[0]

In [164]:
df.head()

     Price  Bedrooms  Bathrooms  Area     Location
0   500000         3          1   120        Miami
1  3600000         4          3   265      Laurent
2  6500000         2          3   214  San Stefano
3  3060000         3          3   204  San Stefano
4  2500000         3          3   165      Laurent

In [166]:
df["Location"].unique()

array(['Miami', 'Laurent', 'San Stefano', 'Agami', 'Smoha', 'Asafra',
       'Roushdy', 'Moharam Bik', 'Sidi Beshr', 'Mandara', 'Sidi Gaber',
       'Bolkly', 'Cleopatra', 'Kafr Abdo', 'Glim', 'Amreya', 'Saba Pasha',
       'Nakheel', 'Gianaclis', 'Gomrok', 'Sporting', 'Montazah',
       'Azarita', 'Al Ibrahimiyyah', 'Stanley', 'Maamoura', 'Seyouf',
       'Al Hadrah', 'Victoria', 'Camp Caesar', 'Abu Qir', 'Fleming',
       'Raml Station', 'Abu Talat', 'Zezenia', 'Dekheila', 'Borg al-Arab',
       'Schutz', 'Awayed', 'Shatby', 'Karmous', 'Attarin', 'Wardian',
       'Dhahria', 'El Max', 'Bahray - Anfoshy', 'Manshiyya', 'Bacchus',
       'Ras El Tin', 'Kabbary', 'Koum al-Dikka', 'Labban', 'Salehia'],
      dtype=object)

# Lets replace "Laurent" with "Louran"

In [169]:
df["Location"] = df["Location"].str.replace('Laurent', "Louran")

In [170]:
df["Location"].unique()

array(['Miami', 'Louran', 'San Stefano', 'Agami', 'Smoha', 'Asafra',
       'Roushdy', 'Moharam Bik', 'Sidi Beshr', 'Mandara', 'Sidi Gaber',
       'Bolkly', 'Cleopatra', 'Kafr Abdo', 'Glim', 'Amreya', 'Saba Pasha',
       'Nakheel', 'Gianaclis', 'Gomrok', 'Sporting', 'Montazah',
       'Azarita', 'Al Ibrahimiyyah', 'Stanley', 'Maamoura', 'Seyouf',
       'Al Hadrah', 'Victoria', 'Camp Caesar', 'Abu Qir', 'Fleming',
       'Raml Station', 'Abu Talat', 'Zezenia', 'Dekheila', 'Borg al-Arab',
       'Schutz', 'Awayed', 'Shatby', 'Karmous', 'Attarin', 'Wardian',
       'Dhahria', 'El Max', 'Bahray - Anfoshy', 'Manshiyya', 'Bacchus',
       'Ras El Tin', 'Kabbary', 'Koum al-Dikka', 'Labban', 'Salehia'],
      dtype=object)

In [171]:
df.head()

     Price  Bedrooms  Bathrooms  Area     Location
0   500000         3          1   120        Miami
1  3600000         4          3   265       Louran
2  6500000         2          3   214  San Stefano
3  3060000         3          3   204  San Stefano
4  2500000         3          3   165       Louran

In [172]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8955 entries, 0 to 8954
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      8955 non-null   int32
 1   Bedrooms   8955 non-null   int32
 2   Bathrooms  8955 non-null   int32
 3   Area       8955 non-null   int32
 4   Location   8955 non-null   object
dtypes: int32(4), object(1)
memory usage: 210.0+ KB

# Finally, It's All Clean Lets now save it

In [173]:
df.to_csv('Data/clean_main_data.csv', index= False)